. do "C:\Users\lyon4\Documents\byuclasses\Economics\E588\Project\epp_SPT.do"

. clear

. cd C:\Users\lyon4\Documents\byuclasses\Economics\E588\Project
C:\Users\lyon4\Documents\byuclasses\Economics\E588\Project

.
. insheet using the_data.csv
(5 vars, 5814 obs)

.
. gen t = _n

. tset t
        time variable:  t, 1 to 5814
                delta:  1 unit

.
. reg sp500 t

      Source |       SS       df       MS              Number of obs =    5814
-------------+------------------------------           F(  1,  5812) =10596.78
       Model |   528436076     1   528436076           Prob > F      =  0.0000
    Residual |   289830450  5812   49867.593           R-squared     =  0.6458
-------------+------------------------------           Adj R-squared =  0.6457
       Total |   818266526  5813  140764.928           Root MSE      =  223.31

------------------------------------------------------------------------------
       sp500 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .1796281    .001745   102.94   0.000     .1762073    .1830489
       _cons |   449.0998   5.858113    76.66   0.000     437.6157    460.5839
------------------------------------------------------------------------------

. estat archlm, lags(1)
LM test for autoregressive conditional heteroskedasticity (ARCH)
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |       5752.554               1                   0.0000
---------------------------------------------------------------------------
         H0: no ARCH effects      vs.  H1: ARCH(p) disturbance

.
. reg vix t

      Source |       SS       df       MS              Number of obs =    5814
-------------+------------------------------           F(  1,  5812) =  281.97
       Model |  17613.8641     1  17613.8641           Prob > F      =  0.0000
    Residual |  363062.861  5812  62.4678013           R-squared     =  0.0463
-------------+------------------------------           Adj R-squared =  0.0461
       Total |  380676.725  5813  65.4871367           Root MSE      =  7.9037

------------------------------------------------------------------------------
         vix |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .0010371   .0000618    16.79   0.000      .000916    .0011581
       _cons |   17.33921   .2073369    83.63   0.000     16.93275    17.74566
------------------------------------------------------------------------------

. estat archlm, lags(1)
LM test for autoregressive conditional heteroskedasticity (ARCH)
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |       5120.435               1                   0.0000
---------------------------------------------------------------------------
         H0: no ARCH effects      vs.  H1: ARCH(p) disturbance

.
. reg dgs10 t

      Source |       SS       df       MS              Number of obs =    5814
-------------+------------------------------           F(  1,  5812) =36478.46
       Model |  14941.4962     1  14941.4962           Prob > F      =  0.0000
    Residual |  2380.58197  5812  .409597723           R-squared     =  0.8626
-------------+------------------------------           Adj R-squared =  0.8625
       Total |  17322.0782  5813  2.97988615           Root MSE      =     .64

------------------------------------------------------------------------------
       dgs10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0009552   5.00e-06  -190.99   0.000     -.000965   -.0009454
       _cons |   7.916827   .0167891   471.55   0.000     7.883914     7.94974
------------------------------------------------------------------------------

. estat archlm, lags(1)
LM test for autoregressive conditional heteroskedasticity (ARCH)
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |       5680.246               1                   0.0000
---------------------------------------------------------------------------
         H0: no ARCH effects      vs.  H1: ARCH(p) disturbance

.
. reg dgs3mo t

      Source |       SS       df       MS              Number of obs =    5814
-------------+------------------------------           F(  1,  5812) = 7406.15
       Model |  16501.4249     1  16501.4249           Prob > F      =  0.0000
    Residual |  12949.5452  5812   2.2280704           R-squared     =  0.5603
-------------+------------------------------           Adj R-squared =  0.5602
       Total |  29450.9701  5813  5.06639774           Root MSE      =  1.4927

------------------------------------------------------------------------------
      dgs3mo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0010038   .0000117   -86.06   0.000    -.0010266   -.0009809
       _cons |   6.265802   .0391573   160.02   0.000     6.189039    6.342565
------------------------------------------------------------------------------

. estat archlm, lags(1)
LM test for autoregressive conditional heteroskedasticity (ARCH)
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |       5789.763               1                   0.0000
---------------------------------------------------------------------------
         H0: no ARCH effects      vs.  H1: ARCH(p) disturbance

.
. arch sp500 t, arch(1) garch(1)


ARCH family regression

Sample: 1 - 5814                                   Number of obs   =      5814
Distribution: Gaussian                             Wald chi2(1)    =  3.10e+06
Log likelihood = -34468.99                         Prob > chi2     =    0.0000

------------------------------------------------------------------------------
             |                 OPG
       sp500 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
sp500        |
           t |    .226231   .0001286  1759.81   0.000      .225979    .2264829
       _cons |   269.7995   .3581854   753.24   0.000     269.0974    270.5015
-------------+----------------------------------------------------------------
ARCH         |
        arch |
         L1. |   .7472694     .07446    10.04   0.000     .6013304    .8932085
             |
       garch |
         L1. |   .2654343   .0369086     7.19   0.000     .1930948    .3377738
             |
       _cons |   9.597279   1.496673     6.41   0.000     6.663853    12.53071
------------------------------------------------------------------------------

. predict sp_archCAST

. arch vix t, arch(1) garch(1)


ARCH family regression

Sample: 1 - 5814                                   Number of obs   =      5814
Distribution: Gaussian                             Wald chi2(1)    =    465.16
Log likelihood = -16576.09                         Prob > chi2     =    0.0000

------------------------------------------------------------------------------
             |                 OPG
         vix |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
vix          |
           t |   .0002915   .0000135    21.57   0.000      .000265     .000318
       _cons |   16.14731   .0476441   338.92   0.000     16.05393    16.24069
-------------+----------------------------------------------------------------
ARCH         |
        arch |
         L1. |    .784109   .0589299    13.31   0.000     .6686086    .8996094
             |
       garch |
         L1. |   .2165781   .0283585     7.64   0.000     .1609965    .2721597
             |
       _cons |   .6045291   .0491652    12.30   0.000     .5081671    .7008912
------------------------------------------------------------------------------

. predict vix_archCAST

. arch dgs10 t, arch(1) garch(1)


ARCH family regression

Sample: 1 - 5814                                   Number of obs   =      5814
Distribution: Gaussian                             Wald chi2(1)    =  1.05e+06
Log likelihood = -2869.013                         Prob > chi2     =    0.0000

------------------------------------------------------------------------------
             |                 OPG
       dgs10 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
dgs10        |
           t |  -.0011496   1.12e-06 -1024.79   0.000    -.0011518   -.0011474
       _cons |   8.480818   .0040509  2093.54   0.000     8.472879    8.488758
-------------+----------------------------------------------------------------
ARCH         |
             |
     archL1. |   .9678515   .0776199    12.47   0.000     .8157193    1.119984
    garchL1. |   .0249221   .0286885     0.87   0.385    -.0313064    .0811506
       _cons |   .0034064   .0003105    10.97   0.000     .0027978     .004015
------------------------------------------------------------------------------

. predict d10_archCAST

. arch dgs3mo t, arch(1) garch(1)


ARCH family regression

Sample: 1 - 5814                                   Number of obs   =      5814
Distribution: Gaussian                             Wald chi2(1)    =  3.62e+06
Log likelihood = -5663.355                         Prob > chi2     =    0.0000

------------------------------------------------------------------------------
             |                 OPG
      dgs3mo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
dgs3mo       |
           t |  -.0014214   7.47e-07 -1902.21   0.000    -.0014229   -.0014199
       _cons |   7.643948   .0024067  3176.14   0.000     7.639231    7.648665
-------------+----------------------------------------------------------------
ARCH         |
             |
    arch L1. |   .6030499   .0435874    13.84   0.000     .5176203    .6884796
   garch L1. |   .4118269   .0168083    24.50   0.000     .3788833    .4447706
       _cons |   .0002132   .0000427     4.99   0.000     .0001295    .0002969
------------------------------------------------------------------------------

. predict d3m_archCAST

end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\lyon4\Documents\byuclasses\Economics\E588\Project\Stata GARCH.log
  log type:  text
 closed on:  13 Apr 2013, 18:31:48
--------------------------------------------------------------------------------------------
