---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k33.log
  log type:  text
 opened on:  29 Nov 2011, 10:23:44

. reg k33 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared tBillRateSquared priceAndSigma priceAndTimeLeft priceAndTBillRate sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 14,    29) =  127.44
       Model |  34.0169059    14  2.42977899           Prob > F      =  0.0000
    Residual |  .552912247    29   .01906594           R-squared     =  0.9840
-------------+------------------------------           Adj R-squared =  0.9763
       Total |  34.5698181    43  .803949259           Root MSE      =  .13808

------------------------------------------------------------------------------
         k33 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -3.403699   1.219319    -2.79   0.009    -5.897486   -.9099121
       sigma |  -6.341556   2.761912    -2.30   0.029     -11.9903   -.6928113
    timeLeft |  -.1954058    .178345    -1.10   0.282    -.5601624    .1693507
   tBillRate |   8.323922   7.589971     1.10   0.282    -7.199312    23.84716
timeLeftSq~s |   .0005525   .0005366     1.03   0.312    -.0005449      .00165
priceSquared |   .0587122   .0174525     3.36   0.002     .0230179    .0944066
sigmaSquared |  -.6998312   .3246058    -2.16   0.040    -1.363725   -.0359378
tBillRateS~d |   .6844037   1.294868     0.53   0.601    -1.963899    3.332707
priceAndSi~a |   .1791319   .0679597     2.64   0.013     .0401387     .318125
priceAndTi~t |   .0035565   .0043988     0.81   0.425    -.0054401     .012553
priceAndTB~e |  -.3407647   .2005612    -1.70   0.100    -.7509584    .0694289
sigmaAndTi~t |   .0397894   .0185438     2.15   0.040     .0018631    .0777158
sigmaAndTB~e |   1.116498   .6707248     1.66   0.107    -.2552884    2.488284
timeLeftAn~e |  -.0113232   .0242114    -0.47   0.644    -.0608411    .0381946
       _cons |   53.17238    22.4693     2.37   0.025     7.217494    99.12726
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44   -57.12671    33.85511     15    -37.71022   -10.94737
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. reg k33 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =  143.80
       Model |  33.9597397    12  2.82997831           Prob > F      =  0.0000
    Residual |  .610078446    31   .01967995           R-squared     =  0.9824
-------------+------------------------------           Adj R-squared =  0.9755
       Total |  34.5698181    43  .803949259           Root MSE      =  .14029

------------------------------------------------------------------------------
         k33 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -3.250069   1.194859    -2.72   0.011    -5.686999   -.8131383
       sigma |  -7.742576   2.681976    -2.89   0.007     -13.2125    -2.27265
    timeLeft |  -.1820679   .1747779    -1.04   0.306    -.5385298    .1743939
   tBillRate |  -2.774696   1.405764    -1.97   0.057    -5.641772    .0923793
timeLeftSq~s |   .0005167   .0005285     0.98   0.336    -.0005611    .0015945
priceSquared |   .0510007   .0164458     3.10   0.004     .0174592    .0845421
sigmaSquared |  -.5966897   .3164073    -1.89   0.069    -1.242007    .0486273
priceAndSi~a |   .2050254   .0672341     3.05   0.005     .0679005    .3421503
priceAndTi~t |   .0020305   .0042259     0.48   0.634    -.0065884    .0106493
sigmaAndTi~t |   .0423602   .0186116     2.28   0.030     .0044016    .0803187
sigmaAndTB~e |   1.170813   .6793577     1.72   0.095    -.2147459    2.556372
timeLeftAn~e |   .0214293    .015044     1.42   0.164    -.0092532    .0521118
       _cons |   57.59831   22.33806     2.58   0.015     12.03954    103.1571
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44   -57.12671    31.69057     13    -37.38113   -14.18667
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. est store ols33

. predict e33, resid

. sktest e33

                    Skewness/Kurtosis tests for Normality
                                                         ------- joint ------
    Variable |    Obs   Pr(Skewness)   Pr(Kurtosis)  adj chi2(2)    Prob>chi2
-------------+---------------------------------------------------------------
         e33 |     44      0.5405         0.3119         1.47         0.4791

. qreg k33 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate
Iteration  1:  WLS sum of weighted deviations =  3.8101268

Iteration  1: sum of abs. weighted deviations =  6.7005409
Iteration  2: sum of abs. weighted deviations =  3.9850458
Iteration  3: sum of abs. weighted deviations =  3.7536568
Iteration  4: sum of abs. weighted deviations =  3.6540704
Iteration  5: sum of abs. weighted deviations =  3.6447534

Median regression                                    Number of obs =        44
  Raw sum of deviations    32.36 (about 1.89)
  Min sum of deviations 3.644753                     Pseudo R2     =    0.8874

------------------------------------------------------------------------------
         k33 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -3.917911    6.00094    -0.65   0.519    -16.15691    8.321088
       sigma |  -7.216353   14.08456    -0.51   0.612    -35.94199    21.50929
    timeLeft |  -.2095785   .8773636    -0.24   0.813    -1.998973    1.579816
   tBillRate |  -1.967851   5.264237    -0.37   0.711    -12.70433    8.768631
timeLeftSq~s |   .0003732   .0026545     0.14   0.889    -.0050407    .0057871
priceSquared |   .0606313   .0835566     0.73   0.474    -.1097836    .2310462
sigmaSquared |  -.3903733   1.887983    -0.21   0.838    -4.240941    3.460194
priceAndSi~a |   .1991376   .3939434     0.51   0.617    -.6043152    1.002591
priceAndTi~t |    .003819   .0222707     0.17   0.865    -.0416023    .0492404
sigmaAndTi~t |   .0300842   .1017359     0.30   0.769    -.1774075     .237576
sigmaAndTB~e |   .7457969   2.531255     0.29   0.770    -4.416732    5.908326
timeLeftAn~e |    .022702   .0456715     0.50   0.623    -.0704456    .1158495
       _cons |   67.64996   109.4871     0.62   0.541    -155.6504    290.9503
------------------------------------------------------------------------------

. estat ic
likelihood information not found in last estimation results
r(321);

. reg k33 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =  143.80
       Model |  33.9597397    12  2.82997831           Prob > F      =  0.0000
    Residual |  .610078446    31   .01967995           R-squared     =  0.9824
-------------+------------------------------           Adj R-squared =  0.9755
       Total |  34.5698181    43  .803949259           Root MSE      =  .14029

------------------------------------------------------------------------------
         k33 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -3.250069   1.194859    -2.72   0.011    -5.686999   -.8131383
       sigma |  -7.742576   2.681976    -2.89   0.007     -13.2125    -2.27265
    timeLeft |  -.1820679   .1747779    -1.04   0.306    -.5385298    .1743939
   tBillRate |  -2.774696   1.405764    -1.97   0.057    -5.641772    .0923793
timeLeftSq~s |   .0005167   .0005285     0.98   0.336    -.0005611    .0015945
priceSquared |   .0510007   .0164458     3.10   0.004     .0174592    .0845421
sigmaSquared |  -.5966897   .3164073    -1.89   0.069    -1.242007    .0486273
priceAndSi~a |   .2050254   .0672341     3.05   0.005     .0679005    .3421503
priceAndTi~t |   .0020305   .0042259     0.48   0.634    -.0065884    .0106493
sigmaAndTi~t |   .0423602   .0186116     2.28   0.030     .0044016    .0803187
sigmaAndTB~e |   1.170813   .6793577     1.72   0.095    -.2147459    2.556372
timeLeftAn~e |   .0214293    .015044     1.42   0.164    -.0092532    .0521118
       _cons |   57.59831   22.33806     2.58   0.015     12.03954    103.1571
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of k33

         chi2(1)      =     5.94
         Prob > chi2  =   0.0148

. estat imtest, white

White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

         chi2(43)     =     44.00
         Prob > chi2  =    0.4290

Cameron & Trivedi's decomposition of IM-test

---------------------------------------------------
              Source |       chi2     df      p
---------------------+-----------------------------
  Heteroskedasticity |      44.00     43    0.4290
            Skewness |       6.48     12    0.8899
            Kurtosis |       0.53      1    0.4647
---------------------+-----------------------------
               Total |      51.02     56    0.6635
---------------------------------------------------

. tsset t
        time variable:  t, 1 to 44
                delta:  1 unit

. estat dwatson

Durbin-Watson d-statistic( 13,    44) =  2.391371

. ac e, lags(2.64776)
option lags() not allowed
r(198);

. reg e33 l.e33

      Source |       SS       df       MS              Number of obs =      43
-------------+------------------------------           F(  1,    41) =    1.69
       Model |  .024051998     1  .024051998           Prob > F      =  0.2012
    Residual |  .584295699    41  .014251115           R-squared     =  0.0395
-------------+------------------------------           Adj R-squared =  0.0161
       Total |  .608347697    42  .014484469           Root MSE      =  .11938

------------------------------------------------------------------------------
         e33 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         e33 |
         L1. |  -.1988175   .1530394    -1.30   0.201    -.5078869     .110252
             |
       _cons |  -.0007734   .0182055    -0.04   0.966    -.0375402    .0359935
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k33.log
  log type:  text
 closed on:  29 Nov 2011, 10:33:36
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
