---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k34.log
  log type:  text
 opened on:  29 Nov 2011, 10:33:48

. reg k34 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared tBillRateSquared priceAndSigma priceAndTimeLeft priceAndTBillRate sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 14,    29) =   79.35
       Model |  19.7996724    14  1.41426232           Prob > F      =  0.0000
    Residual |  .516845276    29  .017822251           R-squared     =  0.9746
-------------+------------------------------           Adj R-squared =  0.9623
       Total |  20.3165177    43  .472477156           Root MSE      =   .1335

------------------------------------------------------------------------------
         k34 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.186647   1.178879    -1.85   0.074    -4.597726    .2244326
       sigma |  -6.940647   2.670312    -2.60   0.015    -12.40205   -1.479245
    timeLeft |  -.0228566   .1724301    -0.13   0.895    -.3755158    .3298026
   tBillRate |  -.5308945   7.338247    -0.07   0.943    -15.53929    14.47751
timeLeftSq~s |   .0000425   .0005188     0.08   0.935    -.0010185    .0011035
priceSquared |   .0379863   .0168737     2.25   0.032     .0034758    .0724969
sigmaSquared |  -.4652069   .3138401    -1.48   0.149    -1.107082    .1766682
tBillRateS~d |   .4579825   1.251923     0.37   0.717    -2.102488    3.018453
priceAndSi~a |   .1571419   .0657058     2.39   0.023     .0227586    .2915253
priceAndTi~t |  -.0014216   .0042529    -0.33   0.741    -.0101197    .0072766
priceAndTB~e |  -.1059834   .1939095    -0.55   0.589    -.5025728    .2906061
sigmaAndTi~t |   .0382115   .0179288     2.13   0.042     .0015429      .07488
sigmaAndTB~e |   1.724826   .6484799     2.66   0.013     .3985355    3.051116
timeLeftAn~e |    .014889   .0234084     0.64   0.530    -.0329865    .0627645
       _cons |   36.46895    21.7241     1.68   0.104    -7.961819    80.89972
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44   -45.43268    35.33913     15    -40.67827   -13.91542
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. reg k34 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =   97.61
       Model |  19.7926953    12  1.64939127           Prob > F      =  0.0000
    Residual |  .523822462    31  .016897499           R-squared     =  0.9742
-------------+------------------------------           Adj R-squared =  0.9642
       Total |  20.3165177    43  .472477156           Root MSE      =  .12999

------------------------------------------------------------------------------
         k34 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.193462   1.107174    -1.98   0.057    -4.451558     .064634
       sigma |  -7.419269   2.485159    -2.99   0.005    -12.48778   -2.350755
    timeLeft |  -.0271031   .1619518    -0.17   0.868    -.3574059    .3031997
   tBillRate |  -3.503552   1.302602    -2.69   0.011    -6.160227   -.8468775
timeLeftSq~s |   .0000549   .0004897     0.11   0.911    -.0009438    .0010536
priceSquared |   .0363157   .0152389     2.38   0.023     .0052357    .0673958
sigmaSquared |  -.4439363   .2931877    -1.51   0.140    -1.041897    .1540239
priceAndSi~a |   .1664814   .0623001     2.67   0.012     .0394194    .2935434
priceAndTi~t |  -.0017177   .0039158    -0.44   0.664    -.0097041    .0062687
sigmaAndTi~t |   .0395269   .0172457     2.29   0.029      .004354    .0746999
sigmaAndTB~e |   1.750718   .6295029     2.78   0.009     .4668388    3.034598
timeLeftAn~e |   .0252051     .01394     1.81   0.080    -.0032258     .053636
       _cons |   38.66169   20.69877     1.87   0.071    -3.553736    80.87712
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44   -45.43268    35.04413     13    -44.08826    -20.8938
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. predict e34, resid

. sktest e34

                    Skewness/Kurtosis tests for Normality
                                                         ------- joint ------
    Variable |    Obs   Pr(Skewness)   Pr(Kurtosis)  adj chi2(2)    Prob>chi2
-------------+---------------------------------------------------------------
         e34 |     44      0.1695         0.1695         3.98         0.1367

. qreg k34 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate
Iteration  1:  WLS sum of weighted deviations =   3.413779

Iteration  1: sum of abs. weighted deviations =  3.3140209
Iteration  2: sum of abs. weighted deviations =  3.2942355
Iteration  3: sum of abs. weighted deviations =  3.2703785
Iteration  4: sum of abs. weighted deviations =   3.268907
Iteration  5: sum of abs. weighted deviations =  3.2608902
Iteration  6: sum of abs. weighted deviations =  3.2608324

Median regression                                    Number of obs =        44
  Raw sum of deviations    24.52 (about 1.33)
  Min sum of deviations 3.260832                     Pseudo R2     =    0.8670

------------------------------------------------------------------------------
         k34 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -1.936476   .6326403    -3.06   0.005    -3.226754   -.6461972
       sigma |  -6.173925    .987151    -6.25   0.000    -8.187233   -4.160617
    timeLeft |   .1247179   .0906314     1.38   0.179    -.0601261    .3095618
   tBillRate |   -2.78139   .4535277    -6.13   0.000    -3.706366   -1.856414
timeLeftSq~s |  -.0004089   .0002527    -1.62   0.116    -.0009244    .0001065
priceSquared |    .035045   .0087444     4.01   0.000     .0172107    .0528793
sigmaSquared |  -.1290566   .1616409    -0.80   0.431    -.4587255    .2006123
priceAndSi~a |   .1316564   .0260523     5.05   0.000     .0785224    .1847904
priceAndTi~t |  -.0043846   .0022732    -1.93   0.063    -.0090209    .0002517
sigmaAndTi~t |   .0234295   .0082244     2.85   0.008     .0066557    .0402033
sigmaAndTB~e |   1.337455    .223228     5.99   0.000     .8821779    1.792731
timeLeftAn~e |   .0237574   .0048323     4.92   0.000     .0139018     .033613
       _cons |   29.81177   11.61541     2.57   0.015     6.121991    53.50155
------------------------------------------------------------------------------

. reg k34 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =   97.61
       Model |  19.7926953    12  1.64939127           Prob > F      =  0.0000
    Residual |  .523822462    31  .016897499           R-squared     =  0.9742
-------------+------------------------------           Adj R-squared =  0.9642
       Total |  20.3165177    43  .472477156           Root MSE      =  .12999

------------------------------------------------------------------------------
         k34 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.193462   1.107174    -1.98   0.057    -4.451558     .064634
       sigma |  -7.419269   2.485159    -2.99   0.005    -12.48778   -2.350755
    timeLeft |  -.0271031   .1619518    -0.17   0.868    -.3574059    .3031997
   tBillRate |  -3.503552   1.302602    -2.69   0.011    -6.160227   -.8468775
timeLeftSq~s |   .0000549   .0004897     0.11   0.911    -.0009438    .0010536
priceSquared |   .0363157   .0152389     2.38   0.023     .0052357    .0673958
sigmaSquared |  -.4439363   .2931877    -1.51   0.140    -1.041897    .1540239
priceAndSi~a |   .1664814   .0623001     2.67   0.012     .0394194    .2935434
priceAndTi~t |  -.0017177   .0039158    -0.44   0.664    -.0097041    .0062687
sigmaAndTi~t |   .0395269   .0172457     2.29   0.029      .004354    .0746999
sigmaAndTB~e |   1.750718   .6295029     2.78   0.009     .4668388    3.034598
timeLeftAn~e |   .0252051     .01394     1.81   0.080    -.0032258     .053636
       _cons |   38.66169   20.69877     1.87   0.071    -3.553736    80.87712
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of k34

         chi2(1)      =     2.98
         Prob > chi2  =   0.0841

. estat imtest, white

White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

         chi2(43)     =     44.00
         Prob > chi2  =    0.4290

Cameron & Trivedi's decomposition of IM-test

---------------------------------------------------
              Source |       chi2     df      p
---------------------+-----------------------------
  Heteroskedasticity |      44.00     43    0.4290
            Skewness |      15.87     12    0.1973
            Kurtosis |       1.06      1    0.3042
---------------------+-----------------------------
               Total |      60.92     56    0.3033
---------------------------------------------------

. estat dwatson

Durbin-Watson d-statistic( 13,    44) =  1.916012

. ac e34

. reg e34 l.e34

      Source |       SS       df       MS              Number of obs =      43
-------------+------------------------------           F(  1,    41) =    0.05
       Model |  .000688854     1  .000688854           Prob > F      =  0.8173
    Residual |  .522515703    41  .012744285           R-squared     =  0.0013
-------------+------------------------------           Adj R-squared = -0.0230
       Total |  .523204557    42  .012457251           Root MSE      =  .11289

------------------------------------------------------------------------------
         e34 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         e34 |
         L1. |   .0364672   .1568542     0.23   0.817    -.2803063    .3532406
             |
       _cons |  -.0006355   .0172179    -0.04   0.971    -.0354077    .0341367
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k34.log
  log type:  text
 closed on:  29 Nov 2011, 10:34:47
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
