---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k35.log
  log type:  text
 opened on:  29 Nov 2011, 10:36:03

. reg k35 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared tBillRateSquared priceAndSigma priceAndTimeLeft priceAndTBillRate sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 14,    29) =   85.37
       Model |  9.14710051    14  .653364322           Prob > F      =  0.0000
    Residual |  .221942467    29  .007653189           R-squared     =  0.9763
-------------+------------------------------           Adj R-squared =  0.9649
       Total |  9.36904298    43   .21788472           Root MSE      =  .08748

------------------------------------------------------------------------------
         k35 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.090318   .7725193    -2.71   0.011    -3.670298   -.5103388
       sigma |  -4.944485   1.749855    -2.83   0.008    -8.523339    -1.36563
    timeLeft |  -.0044271   .1129934    -0.04   0.969    -.2355245    .2266704
   tBillRate |  -1.498495    4.80875    -0.31   0.758    -11.33349    8.336504
timeLeftSq~s |  -.0003321     .00034    -0.98   0.337    -.0010274    .0003631
priceSquared |   .0336632   .0110573     3.04   0.005     .0110485    .0562779
sigmaSquared |  -.4197877   .2056593    -2.04   0.050    -.8404082    .0008328
tBillRateS~d |   .4743479   .8203849     0.58   0.568    -1.203528    2.152223
priceAndSi~a |   .1428491    .043057     3.32   0.002     .0547877    .2309104
priceAndTi~t |  -.0007224   .0027869    -0.26   0.797    -.0064223    .0049775
priceAndTB~e |   -.037357   .1270688    -0.29   0.771    -.2972419    .2225279
sigmaAndTi~t |   .0273229   .0117487     2.33   0.027      .003294    .0513518
sigmaAndTB~e |   .6779333   .4249487     1.60   0.121    -.1911843    1.547051
timeLeftAn~e |   .0164509   .0153395     1.07   0.292     -.014922    .0478237
       _cons |   35.04352   14.23579     2.46   0.020     5.928055    64.15899
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44   -28.40416    53.93629     15    -77.87258   -51.10974
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. reg k35 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =  105.03
       Model |  9.14414215    12  .762011846           Prob > F      =  0.0000
    Residual |  .224900835    31  .007254866           R-squared     =  0.9760
-------------+------------------------------           Adj R-squared =  0.9667
       Total |  9.36904298    43   .21788472           Root MSE      =  .08518

------------------------------------------------------------------------------
         k35 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.162417   .7254697    -2.98   0.006    -3.642023   -.6828122
       sigma |  -5.167932   1.628387    -3.17   0.003    -8.489049   -1.846815
    timeLeft |  -.0166405    .106118    -0.16   0.876    -.2330697    .1997886
   tBillRate |  -1.934568   .8535231    -2.27   0.031    -3.675339   -.1937958
timeLeftSq~s |  -.0002977   .0003209    -0.93   0.361    -.0009521    .0003567
priceSquared |   .0340035   .0099852     3.41   0.002     .0136385    .0543685
sigmaSquared |  -.4260877   .1921097    -2.22   0.034    -.8178979   -.0342775
priceAndSi~a |    .147783   .0408218     3.62   0.001     .0645263    .2310396
priceAndTi~t |  -.0005989   .0025658    -0.23   0.817     -.005832    .0046341
sigmaAndTi~t |   .0284452   .0113002     2.52   0.017     .0053983    .0514921
sigmaAndTB~e |   .6985486   .4124784     1.69   0.100    -.1427066    1.539804
timeLeftAn~e |   .0202524   .0091341     2.22   0.034     .0016233    .0388816
       _cons |   36.85837   13.56276     2.72   0.011     9.196937     64.5198
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44   -28.40416    53.64498     13    -81.28996    -58.0955
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. predict e35, resid

. sktest e35

                    Skewness/Kurtosis tests for Normality
                                                         ------- joint ------
    Variable |    Obs   Pr(Skewness)   Pr(Kurtosis)  adj chi2(2)    Prob>chi2
-------------+---------------------------------------------------------------
         e35 |     44      0.6022         0.1353         2.66         0.2641

. qreg k35 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate
Iteration  1:  WLS sum of weighted deviations =  2.2098697

Iteration  1: sum of abs. weighted deviations =  2.4872581
Iteration  2: sum of abs. weighted deviations =  2.1529819
Iteration  3: sum of abs. weighted deviations =  2.1422194
Iteration  4: sum of abs. weighted deviations =  2.1416085
Iteration  5: sum of abs. weighted deviations =  2.1391658

Median regression                                    Number of obs =        44
  Raw sum of deviations    16.55 (about .75999999)
  Min sum of deviations 2.139166                     Pseudo R2     =    0.8707

------------------------------------------------------------------------------
         k35 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.287728   4.116688    -0.56   0.582    -10.68377    6.108313
       sigma |  -5.052948   8.924718    -0.57   0.575    -23.25503    13.14913
    timeLeft |   -.048452   .6888445    -0.07   0.944     -1.45336    1.356456
   tBillRate |  -1.578698   3.138655    -0.50   0.619    -7.980027    4.822632
timeLeftSq~s |  -.0001635   .0022251    -0.07   0.942    -.0047017    .0043746
priceSquared |   .0354271   .0562792     0.63   0.534    -.0793552    .1502094
sigmaSquared |  -.4742355    1.27206    -0.37   0.712    -3.068619    2.120148
priceAndSi~a |   .1541572   .2403378     0.64   0.526    -.3360149    .6443294
priceAndTi~t |   .0003888   .0161547     0.02   0.981     -.032559    .0333366
sigmaAndTi~t |   .0266493   .0707468     0.38   0.709    -.1176397    .1709384
sigmaAndTB~e |   .5815218   1.595495     0.36   0.718    -2.672511    3.835555
timeLeftAn~e |   .0165119   .0369093     0.45   0.658    -.0587651    .0917889
       _cons |   38.90294   77.91259     0.50   0.621    -120.0008    197.8067
------------------------------------------------------------------------------

. reg k35 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =  105.03
       Model |  9.14414215    12  .762011846           Prob > F      =  0.0000
    Residual |  .224900835    31  .007254866           R-squared     =  0.9760
-------------+------------------------------           Adj R-squared =  0.9667
       Total |  9.36904298    43   .21788472           Root MSE      =  .08518

------------------------------------------------------------------------------
         k35 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.162417   .7254697    -2.98   0.006    -3.642023   -.6828122
       sigma |  -5.167932   1.628387    -3.17   0.003    -8.489049   -1.846815
    timeLeft |  -.0166405    .106118    -0.16   0.876    -.2330697    .1997886
   tBillRate |  -1.934568   .8535231    -2.27   0.031    -3.675339   -.1937958
timeLeftSq~s |  -.0002977   .0003209    -0.93   0.361    -.0009521    .0003567
priceSquared |   .0340035   .0099852     3.41   0.002     .0136385    .0543685
sigmaSquared |  -.4260877   .1921097    -2.22   0.034    -.8178979   -.0342775
priceAndSi~a |    .147783   .0408218     3.62   0.001     .0645263    .2310396
priceAndTi~t |  -.0005989   .0025658    -0.23   0.817     -.005832    .0046341
sigmaAndTi~t |   .0284452   .0113002     2.52   0.017     .0053983    .0514921
sigmaAndTB~e |   .6985486   .4124784     1.69   0.100    -.1427066    1.539804
timeLeftAn~e |   .0202524   .0091341     2.22   0.034     .0016233    .0388816
       _cons |   36.85837   13.56276     2.72   0.011     9.196937     64.5198
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of k35

         chi2(1)      =     0.21
         Prob > chi2  =   0.6459

. estat imtest, white

White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

         chi2(43)     =     44.00
         Prob > chi2  =    0.4290

Cameron & Trivedi's decomposition of IM-test

---------------------------------------------------
              Source |       chi2     df      p
---------------------+-----------------------------
  Heteroskedasticity |      44.00     43    0.4290
            Skewness |       9.87     12    0.6276
            Kurtosis |       2.27      1    0.1323
---------------------+-----------------------------
               Total |      56.13     56    0.4699
---------------------------------------------------

. estat dwatson

Durbin-Watson d-statistic( 13,    44) =  1.600672

. ac e35

. reg e35 l.e35

      Source |       SS       df       MS              Number of obs =      43
-------------+------------------------------           F(  1,    41) =    1.47
       Model |  .007784016     1  .007784016           Prob > F      =  0.2320
    Residual |  .216807211    41  .005287981           R-squared     =  0.0347
-------------+------------------------------           Adj R-squared =  0.0111
       Total |  .224591226    42   .00534741           Root MSE      =  .07272

------------------------------------------------------------------------------
         e35 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         e35 |
         L1. |   .1892065   .1559478     1.21   0.232    -.1257364    .5041494
             |
       _cons |  -.0007804   .0110938    -0.07   0.944    -.0231847     .021624
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k35.log
  log type:  text
 closed on:  29 Nov 2011, 10:37:02
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
