---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k37.log
  log type:  text
 opened on:  29 Nov 2011, 10:38:12

. reg k37 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared tBillRateSquared priceAndSigma priceAndTimeLeft priceAndTBillRate sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 14,    29) =   63.31
       Model |  1.42083128    14  .101487948           Prob > F      =  0.0000
    Residual |  .046484638    29  .001602919           R-squared     =  0.9683
-------------+------------------------------           Adj R-squared =  0.9530
       Total |  1.46731592    43  .034123626           Root MSE      =  .04004

------------------------------------------------------------------------------
         k37 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.824775   .3535443    -7.99   0.000    -3.547854   -2.101696
       sigma |   .3264775    .800823     0.41   0.687    -1.311389    1.964344
    timeLeft |  -.1977564   .0517116    -3.82   0.001    -.3035184   -.0919944
   tBillRate |  -4.517677    2.20073    -2.05   0.049    -9.018675   -.0166785
timeLeftSq~s |  -.0000881   .0001556    -0.57   0.575    -.0004063    .0002301
priceSquared |   .0402326   .0050604     7.95   0.000     .0298829    .0505822
sigmaSquared |  -.1517238   .0941202    -1.61   0.118    -.3442213    .0407736
tBillRateS~d |   .6654649   .3754501     1.77   0.087    -.1024167    1.433346
priceAndSi~a |   .0038392   .0197051     0.19   0.847    -.0364622    .0441406
priceAndTi~t |   .0059946   .0012754     4.70   0.000      .003386    .0086031
priceAndTB~e |   .0734565   .0581532     1.26   0.217    -.0454802    .1923931
sigmaAndTi~t |   .0009294   .0053768     0.17   0.864    -.0100674    .0119263
sigmaAndTB~e |   .1708869   .1944782     0.88   0.387    -.2268657    .5686395
timeLeftAn~e |   .0122988   .0070201     1.75   0.090     -.002059    .0266566
       _cons |   50.18204   6.515027     7.70   0.000     36.85731    63.50677
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44    12.38331    88.32881     15    -146.6576   -119.8948
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. reg k37 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =   66.31
       Model |  1.41229208    12  .117691007           Prob > F      =  0.0000
    Residual |  .055023833    31  .001774962           R-squared     =  0.9625
-------------+------------------------------           Adj R-squared =  0.9480
       Total |  1.46731592    43  .034123626           Root MSE      =  .04213

------------------------------------------------------------------------------
         k37 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -3.038973   .3588386    -8.47   0.000    -3.770829   -2.307117
       sigma |    .486258    .805448     0.60   0.550    -1.156464     2.12898
    timeLeft |  -.2284746   .0524891    -4.35   0.000    -.3355268   -.1214224
   tBillRate |  -.5358771   .4221776    -1.27   0.214    -1.396914    .3251597
timeLeftSq~s |  -2.22e-06   .0001587    -0.01   0.989    -.0003259    .0003215
priceSquared |    .044309    .004939     8.97   0.000     .0342358    .0543821
sigmaSquared |  -.2098047   .0950231    -2.21   0.035    -.4036055   -.0160038
priceAndSi~a |   .0025234   .0201917     0.12   0.901    -.0386578    .0437046
priceAndTi~t |   .0069154   .0012691     5.45   0.000      .004327    .0095038
sigmaAndTi~t |   .0020865   .0055894     0.37   0.711    -.0093132    .0134861
sigmaAndTB~e |   .1890275   .2040239     0.93   0.361    -.2270821     .605137
timeLeftAn~e |   .0056681    .004518     1.25   0.219    -.0035464    .0148827
       _cons |   51.93507   6.708539     7.74   0.000     38.25292    65.61723
------------------------------------------------------------------------------

. estat ic

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |     44    12.38331    84.61863     13    -143.2373   -120.0428
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. predict e37, resid

. sktest e37

                    Skewness/Kurtosis tests for Normality
                                                         ------- joint ------
    Variable |    Obs   Pr(Skewness)   Pr(Kurtosis)  adj chi2(2)    Prob>chi2
-------------+---------------------------------------------------------------
         e37 |     44      0.2268         0.2171         3.18         0.2036

. qreg k37 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate
Iteration  1:  WLS sum of weighted deviations =   1.110209

Iteration  1: sum of abs. weighted deviations =  1.2912717
Iteration  2: sum of abs. weighted deviations =  1.1001992
Iteration  3: sum of abs. weighted deviations =  1.0951306
Iteration  4: sum of abs. weighted deviations =  1.0927578
Iteration  5: sum of abs. weighted deviations =  1.0913736

Median regression                                    Number of obs =        44
  Raw sum of deviations     5.81 (about .25999999)
  Min sum of deviations 1.091374                     Pseudo R2     =    0.8122

------------------------------------------------------------------------------
         k37 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -2.942347   .7799729    -3.77   0.001    -4.533113   -1.351582
       sigma |    .933141   1.390668     0.67   0.507    -1.903145    3.769427
    timeLeft |  -.2077295   .1053888    -1.97   0.058    -.4226713    .0072123
   tBillRate |  -.2790611   .5522576    -0.51   0.617    -1.405398    .8472757
timeLeftSq~s |   -.000073   .0002946    -0.25   0.806    -.0006738    .0005279
priceSquared |      .0432   .0107844     4.01   0.000      .021205     .065195
sigmaSquared |   -.154071   .1842744    -0.84   0.409    -.5299012    .2217592
priceAndSi~a |  -.0080602    .038969    -0.21   0.837     -.087538    .0714175
priceAndTi~t |   .0066092   .0025602     2.58   0.015     .0013877    .0118307
sigmaAndTi~t |  -.0009579   .0104919    -0.09   0.928    -.0223563    .0204405
sigmaAndTB~e |   .0428416   .2705305     0.16   0.875     -.508909    .5945922
timeLeftAn~e |   .0046877   .0060894     0.77   0.447    -.0077317    .0171072
       _cons |   49.55297   14.53793     3.41   0.002     19.90267    79.20327
------------------------------------------------------------------------------

. reg k37 price sigma timeLeft tBillRate timeLeftSquares priceSquared sigmaSquared priceAndSigma priceAndTimeLeft sigmaAndTimeLeft sigmaAndTBillRate timeLeftAndTBillRate

      Source |       SS       df       MS              Number of obs =      44
-------------+------------------------------           F( 12,    31) =   66.31
       Model |  1.41229208    12  .117691007           Prob > F      =  0.0000
    Residual |  .055023833    31  .001774962           R-squared     =  0.9625
-------------+------------------------------           Adj R-squared =  0.9480
       Total |  1.46731592    43  .034123626           Root MSE      =  .04213

------------------------------------------------------------------------------
         k37 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -3.038973   .3588386    -8.47   0.000    -3.770829   -2.307117
       sigma |    .486258    .805448     0.60   0.550    -1.156464     2.12898
    timeLeft |  -.2284746   .0524891    -4.35   0.000    -.3355268   -.1214224
   tBillRate |  -.5358771   .4221776    -1.27   0.214    -1.396914    .3251597
timeLeftSq~s |  -2.22e-06   .0001587    -0.01   0.989    -.0003259    .0003215
priceSquared |    .044309    .004939     8.97   0.000     .0342358    .0543821
sigmaSquared |  -.2098047   .0950231    -2.21   0.035    -.4036055   -.0160038
priceAndSi~a |   .0025234   .0201917     0.12   0.901    -.0386578    .0437046
priceAndTi~t |   .0069154   .0012691     5.45   0.000      .004327    .0095038
sigmaAndTi~t |   .0020865   .0055894     0.37   0.711    -.0093132    .0134861
sigmaAndTB~e |   .1890275   .2040239     0.93   0.361    -.2270821     .605137
timeLeftAn~e |   .0056681    .004518     1.25   0.219    -.0035464    .0148827
       _cons |   51.93507   6.708539     7.74   0.000     38.25292    65.61723
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of k37

         chi2(1)      =     8.79
         Prob > chi2  =   0.0030

. estat imtest, white

White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

         chi2(43)     =     44.00
         Prob > chi2  =    0.4290

Cameron & Trivedi's decomposition of IM-test

---------------------------------------------------
              Source |       chi2     df      p
---------------------+-----------------------------
  Heteroskedasticity |      44.00     43    0.4290
            Skewness |      12.01     12    0.4447
            Kurtosis |       1.07      1    0.3000
---------------------+-----------------------------
               Total |      57.09     56    0.4345
---------------------------------------------------

. estat dwatson

Durbin-Watson d-statistic( 13,    44) =  2.084376

. ac e37

. reg e37 l.e37

      Source |       SS       df       MS              Number of obs =      43
-------------+------------------------------           F(  1,    41) =    0.08
       Model |  .000108744     1  .000108744           Prob > F      =  0.7770
    Residual |   .05485866    41  .001338016           R-squared     =  0.0020
-------------+------------------------------           Adj R-squared = -0.0224
       Total |  .054967404    42  .001308748           Root MSE      =  .03658

------------------------------------------------------------------------------
         e37 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         e37 |
         L1. |  -.0445347   .1562161    -0.29   0.777    -.3600196    .2709502
             |
       _cons |  -.0001584   .0055785    -0.03   0.977    -.0114243    .0111075
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/spencerlyon2/Documents/k37.log
  log type:  text
 closed on:  29 Nov 2011, 10:39:14
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
